grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
#pragma once 

/* --- SMC: Static Memory Controller -------------------------------- */

/** @defgroup smc_registers Static Memory Controller Register
@{*/

/** SMC_CFG SMC NFC Configuration Register **/
#define SMC_CFG			MMIO32(SMC_BASE + 0x00)
/** SMC_CTRL SMC NFC Control Register **/
#define SMC_CTRL			MMIO32(SMC_BASE + 0x04)
/** SMC_SR SMC NFC Status Register **/
#define SMC_SR			MMIO32(SMC_BASE + 0x08)
/** SMC_IER SMC NFC Interrupt Enable Register **/
#define SMC_IER			MMIO32(SMC_BASE + 0x0c)
/** SMC_IDR SMC NFC Interrupt Disable Register **/
#define SMC_IDR			MMIO32(SMC_BASE + 0x10)
/** SMC_IMR SMC NFC Interrupt Mask Register **/
#define SMC_IMR			MMIO32(SMC_BASE + 0x14)
/** SMC_ADDR SMC NFC Address Cycle Zero Register **/
#define SMC_ADDR			MMIO32(SMC_BASE + 0x18)
/** SMC_BANK SMC Bank Address Register **/
#define SMC_BANK			MMIO32(SMC_BASE + 0x1c)
/** SMC_ECC_CTRL SMC ECC Control Register **/
#define SMC_ECC_CTRL			MMIO32(SMC_BASE + 0x20)
/** SMC_ECC_MD SMC ECC Mode Register **/
#define SMC_ECC_MD			MMIO32(SMC_BASE + 0x24)
/** SMC_ECC_SR1 SMC ECC Status 1 Register **/
#define SMC_ECC_SR1			MMIO32(SMC_BASE + 0x28)
/** SMC_ECC_PR0 SMC ECC Parity 0 Register **/
#define SMC_ECC_PR0			MMIO32(SMC_BASE + 0x2c)
/** SMC_ECC_PR0_W9BIT SMC ECC Parity 0 Register **/
#define SMC_ECC_PR0_W9BIT			MMIO32(SMC_BASE + 0x2c)
/** SMC_ECC_PR0_W8BIT SMC ECC Parity 0 Register **/
#define SMC_ECC_PR0_W8BIT			MMIO32(SMC_BASE + 0x2c)
/** SMC_ECC_PR1 SMC ECC parity 1 Register **/
#define SMC_ECC_PR1			MMIO32(SMC_BASE + 0x30)
/** SMC_ECC_PR1_W9BIT SMC ECC parity 1 Register **/
#define SMC_ECC_PR1_W9BIT			MMIO32(SMC_BASE + 0x30)
/** SMC_ECC_PR1_W8BIT SMC ECC parity 1 Register **/
#define SMC_ECC_PR1_W8BIT			MMIO32(SMC_BASE + 0x30)
/** SMC_ECC_SR2 SMC ECC status 2 Register **/
#define SMC_ECC_SR2			MMIO32(SMC_BASE + 0x34)
/** SMC_ECC_PR2 SMC ECC parity 2 Register **/
#define SMC_ECC_PR2			MMIO32(SMC_BASE + 0x38)
/** SMC_ECC_PR2_W8BIT SMC ECC parity 2 Register **/
#define SMC_ECC_PR2_W8BIT			MMIO32(SMC_BASE + 0x38)
/** SMC_ECC_PR3 SMC ECC parity 3 Register **/
#define SMC_ECC_PR3			MMIO32(SMC_BASE + 0x3c)
/** SMC_ECC_PR3_W8BIT SMC ECC parity 3 Register **/
#define SMC_ECC_PR3_W8BIT			MMIO32(SMC_BASE + 0x3c)
/** SMC_ECC_PR4 SMC ECC parity 4 Register **/
#define SMC_ECC_PR4			MMIO32(SMC_BASE + 0x40)
/** SMC_ECC_PR4_W8BIT SMC ECC parity 4 Register **/
#define SMC_ECC_PR4_W8BIT			MMIO32(SMC_BASE + 0x40)
/** SMC_ECC_PR5 SMC ECC parity 5 Register **/
#define SMC_ECC_PR5			MMIO32(SMC_BASE + 0x44)
/** SMC_ECC_PR5_W8BIT SMC ECC parity 5 Register **/
#define SMC_ECC_PR5_W8BIT			MMIO32(SMC_BASE + 0x44)
/** SMC_ECC_PR6 SMC ECC parity 6 Register **/
#define SMC_ECC_PR6			MMIO32(SMC_BASE + 0x48)
/** SMC_ECC_PR6_W8BIT SMC ECC parity 6 Register **/
#define SMC_ECC_PR6_W8BIT			MMIO32(SMC_BASE + 0x48)
/** SMC_ECC_PR7 SMC ECC parity 7 Register **/
#define SMC_ECC_PR7			MMIO32(SMC_BASE + 0x4c)
/** SMC_ECC_PR7_W8BIT SMC ECC parity 7 Register **/
#define SMC_ECC_PR7_W8BIT			MMIO32(SMC_BASE + 0x4c)
/** SMC_ECC_PR8 SMC ECC parity 8 Register **/
#define SMC_ECC_PR8			MMIO32(SMC_BASE + 0x50)
/** SMC_ECC_PR9 SMC ECC parity 9 Register **/
#define SMC_ECC_PR9			MMIO32(SMC_BASE + 0x54)
/** SMC_ECC_PR10 SMC ECC parity 10 Register **/
#define SMC_ECC_PR10			MMIO32(SMC_BASE + 0x58)
/** SMC_ECC_PR11 SMC ECC parity 11 Register **/
#define SMC_ECC_PR11			MMIO32(SMC_BASE + 0x5c)
/** SMC_ECC_PR12 SMC ECC parity 12 Register **/
#define SMC_ECC_PR12			MMIO32(SMC_BASE + 0x60)
/** SMC_ECC_PR13 SMC ECC parity 13 Register **/
#define SMC_ECC_PR13			MMIO32(SMC_BASE + 0x64)
/** SMC_ECC_PR14 SMC ECC parity 14 Register **/
#define SMC_ECC_PR14			MMIO32(SMC_BASE + 0x68)
/** SMC_ECC_PR15 SMC ECC parity 15 Register **/
#define SMC_ECC_PR15			MMIO32(SMC_BASE + 0x6c)
/** SMC_SETUP0 SMC Setup Register (CS_number = 0) **/
#define SMC_SETUP0			MMIO32(SMC_BASE + 0x70)
/** SMC_PULSE0 SMC Pulse Register (CS_number = 0) **/
#define SMC_PULSE0			MMIO32(SMC_BASE + 0x74)
/** SMC_CYCLE0 SMC Cycle Register (CS_number = 0) **/
#define SMC_CYCLE0			MMIO32(SMC_BASE + 0x78)
/** SMC_TIMINGS0 SMC Timings Register (CS_number = 0) **/
#define SMC_TIMINGS0			MMIO32(SMC_BASE + 0x7c)
/** SMC_MODE0 SMC Mode Register (CS_number = 0) **/
#define SMC_MODE0			MMIO32(SMC_BASE + 0x80)
/** SMC_SETUP1 SMC Setup Register (CS_number = 1) **/
#define SMC_SETUP1			MMIO32(SMC_BASE + 0x84)
/** SMC_PULSE1 SMC Pulse Register (CS_number = 1) **/
#define SMC_PULSE1			MMIO32(SMC_BASE + 0x88)
/** SMC_CYCLE1 SMC Cycle Register (CS_number = 1) **/
#define SMC_CYCLE1			MMIO32(SMC_BASE + 0x8c)
/** SMC_TIMINGS1 SMC Timings Register (CS_number = 1) **/
#define SMC_TIMINGS1			MMIO32(SMC_BASE + 0x90)
/** SMC_MODE1 SMC Mode Register (CS_number = 1) **/
#define SMC_MODE1			MMIO32(SMC_BASE + 0x94)
/** SMC_SETUP2 SMC Setup Register (CS_number = 2) **/
#define SMC_SETUP2			MMIO32(SMC_BASE + 0x98)
/** SMC_PULSE2 SMC Pulse Register (CS_number = 2) **/
#define SMC_PULSE2			MMIO32(SMC_BASE + 0x9c)
/** SMC_CYCLE2 SMC Cycle Register (CS_number = 2) **/
#define SMC_CYCLE2			MMIO32(SMC_BASE + 0xa0)
/** SMC_TIMINGS2 SMC Timings Register (CS_number = 2) **/
#define SMC_TIMINGS2			MMIO32(SMC_BASE + 0xa4)
/** SMC_MODE2 SMC Mode Register (CS_number = 2) **/
#define SMC_MODE2			MMIO32(SMC_BASE + 0xa8)
/** SMC_SETUP3 SMC Setup Register (CS_number = 3) **/
#define SMC_SETUP3			MMIO32(SMC_BASE + 0xac)
/** SMC_PULSE3 SMC Pulse Register (CS_number = 3) **/
#define SMC_PULSE3			MMIO32(SMC_BASE + 0xb0)
/** SMC_CYCLE3 SMC Cycle Register (CS_number = 3) **/
#define SMC_CYCLE3			MMIO32(SMC_BASE + 0xb4)
/** SMC_TIMINGS3 SMC Timings Register (CS_number = 3) **/
#define SMC_TIMINGS3			MMIO32(SMC_BASE + 0xb8)
/** SMC_MODE3 SMC Mode Register (CS_number = 3) **/
#define SMC_MODE3			MMIO32(SMC_BASE + 0xbc)
/** SMC_SETUP4 SMC Setup Register (CS_number = 4) **/
#define SMC_SETUP4			MMIO32(SMC_BASE + 0xc0)
/** SMC_PULSE4 SMC Pulse Register (CS_number = 4) **/
#define SMC_PULSE4			MMIO32(SMC_BASE + 0xc4)
/** SMC_CYCLE4 SMC Cycle Register (CS_number = 4) **/
#define SMC_CYCLE4			MMIO32(SMC_BASE + 0xc8)
/** SMC_TIMINGS4 SMC Timings Register (CS_number = 4) **/
#define SMC_TIMINGS4			MMIO32(SMC_BASE + 0xcc)
/** SMC_MODE4 SMC Mode Register (CS_number = 4) **/
#define SMC_MODE4			MMIO32(SMC_BASE + 0xd0)
/** SMC_SETUP5 SMC Setup Register (CS_number = 5) **/
#define SMC_SETUP5			MMIO32(SMC_BASE + 0xd4)
/** SMC_PULSE5 SMC Pulse Register (CS_number = 5) **/
#define SMC_PULSE5			MMIO32(SMC_BASE + 0xd8)
/** SMC_CYCLE5 SMC Cycle Register (CS_number = 5) **/
#define SMC_CYCLE5			MMIO32(SMC_BASE + 0xdc)
/** SMC_TIMINGS5 SMC Timings Register (CS_number = 5) **/
#define SMC_TIMINGS5			MMIO32(SMC_BASE + 0xe0)
/** SMC_MODE5 SMC Mode Register (CS_number = 5) **/
#define SMC_MODE5			MMIO32(SMC_BASE + 0xe4)
/** SMC_SETUP6 SMC Setup Register (CS_number = 6) **/
#define SMC_SETUP6			MMIO32(SMC_BASE + 0xe8)
/** SMC_PULSE6 SMC Pulse Register (CS_number = 6) **/
#define SMC_PULSE6			MMIO32(SMC_BASE + 0xec)
/** SMC_CYCLE6 SMC Cycle Register (CS_number = 6) **/
#define SMC_CYCLE6			MMIO32(SMC_BASE + 0xf0)
/** SMC_TIMINGS6 SMC Timings Register (CS_number = 6) **/
#define SMC_TIMINGS6			MMIO32(SMC_BASE + 0xf4)
/** SMC_MODE6 SMC Mode Register (CS_number = 6) **/
#define SMC_MODE6			MMIO32(SMC_BASE + 0xf8)
/** SMC_SETUP7 SMC Setup Register (CS_number = 7) **/
#define SMC_SETUP7			MMIO32(SMC_BASE + 0xfc)
/** SMC_PULSE7 SMC Pulse Register (CS_number = 7) **/
#define SMC_PULSE7			MMIO32(SMC_BASE + 0x100)
/** SMC_CYCLE7 SMC Cycle Register (CS_number = 7) **/
#define SMC_CYCLE7			MMIO32(SMC_BASE + 0x104)
/** SMC_TIMINGS7 SMC Timings Register (CS_number = 7) **/
#define SMC_TIMINGS7			MMIO32(SMC_BASE + 0x108)
/** SMC_MODE7 SMC Mode Register (CS_number = 7) **/
#define SMC_MODE7			MMIO32(SMC_BASE + 0x10c)
/** SMC_OCMS SMC OCMS Register **/
#define SMC_OCMS			MMIO32(SMC_BASE + 0x110)
/** SMC_KEY1 SMC OCMS KEY1 Register **/
#define SMC_KEY1			MMIO32(SMC_BASE + 0x114)
/** SMC_KEY2 SMC OCMS KEY2 Register **/
#define SMC_KEY2			MMIO32(SMC_BASE + 0x118)
/** SMC_WPCR Write Protection Control Register **/
#define SMC_WPCR			MMIO32(SMC_BASE + 0x1e4)
/** SMC_WPSR Write Protection Status Register **/
#define SMC_WPSR			MMIO32(SMC_BASE + 0x1e8)

/**@}*/


/** @defgroup smc_cfg CFG SMC NFC Configuration Register
@{*/


#define SMC_CFG_DTOMUL_SHIFT		20
#define SMC_CFG_DTOMUL_MASK		0x07
/** @defgroup smc_cfg_dtomul DTOMUL Data Timeout Multiplier
@{*/
/**@}*/


