grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
#define SMC_CFG_DTOCYC_SHIFT		16
#define SMC_CFG_DTOCYC_MASK		0x0f
/** @defgroup smc_cfg_dtocyc DTOCYC Data Timeout Cycle Number
@{*/
/**@}*/

/** SMC_CFG_RBEDGE Ready/Busy Signal Edge Detection **/
#define SMC_CFG_RBEDGE		(1 << 13)
/** SMC_CFG_EDGECTRL Rising/Falling Edge Detection Control **/
#define SMC_CFG_EDGECTRL		(1 << 12)
/** SMC_CFG_RSPARE Read Spare Area **/
#define SMC_CFG_RSPARE		(1 << 9)
/** SMC_CFG_WSPARE Write Spare Area **/
#define SMC_CFG_WSPARE		(1 << 8)

#define SMC_CFG_PAGESIZE_SHIFT		0
#define SMC_CFG_PAGESIZE_MASK		0x03
/** @defgroup smc_cfg_pagesize PAGESIZE Page Size of the NAND Flash Device
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ctrl CTRL SMC NFC Control Register
@{*/

/** SMC_CTRL_NFCDIS NAND Flash Controller Disable **/
#define SMC_CTRL_NFCDIS		(1 << 1)
/** SMC_CTRL_NFCEN NAND Flash Controller Enable **/
#define SMC_CTRL_NFCEN		(1 << 0)

/**@}*/

/** @defgroup smc_sr SR SMC NFC Status Register
@{*/

/** SMC_SR_RB_EDGE0 Ready/Busy Line 0 Edge Detected **/
#define SMC_SR_RB_EDGE0		(1 << 24)
/** SMC_SR_NFCASE NFC Access Size Error **/
#define SMC_SR_NFCASE		(1 << 23)
/** SMC_SR_AWB Accessing While Busy **/
#define SMC_SR_AWB		(1 << 22)
/** SMC_SR_UNDEF Undefined Area Error **/
#define SMC_SR_UNDEF		(1 << 21)
/** SMC_SR_DTOE Data Timeout Error **/
#define SMC_SR_DTOE		(1 << 20)
/** SMC_SR_CMDDONE Command Done **/
#define SMC_SR_CMDDONE		(1 << 17)
/** SMC_SR_XFRDONE NFC Data Transfer Terminated **/
#define SMC_SR_XFRDONE		(1 << 16)

#define SMC_SR_NFCSID_SHIFT		12
#define SMC_SR_NFCSID_MASK		0x07
/** @defgroup smc_sr_nfcsid NFCSID NFC Chip Select ID (this field cannot be reset)
@{*/
/**@}*/

/** SMC_SR_NFCWR NFC Write/Read Operation (this field cannot be reset) **/
#define SMC_SR_NFCWR		(1 << 11)
/** SMC_SR_NFCBUSY NFC Busy (this field cannot be reset) **/
#define SMC_SR_NFCBUSY		(1 << 8)
/** SMC_SR_RB_FALL Selected Ready Busy Falling Edge Detected **/
#define SMC_SR_RB_FALL		(1 << 5)
/** SMC_SR_RB_RISE Selected Ready Busy Rising Edge Detected **/
#define SMC_SR_RB_RISE		(1 << 4)
/** SMC_SR_SMCSTS NAND Flash Controller status (this field cannot be reset) **/
#define SMC_SR_SMCSTS		(1 << 0)

/**@}*/

/** @defgroup smc_ier IER SMC NFC Interrupt Enable Register
@{*/

/** SMC_IER_RB_EDGE0 Ready/Busy Line 0 Interrupt Enable **/
#define SMC_IER_RB_EDGE0		(1 << 24)
/** SMC_IER_NFCASE NFC Access Size Error Interrupt Enable **/
#define SMC_IER_NFCASE		(1 << 23)
/** SMC_IER_AWB Accessing While Busy Interrupt Enable **/
#define SMC_IER_AWB		(1 << 22)
/** SMC_IER_UNDEF Undefined Area Access Interrupt Enable **/
#define SMC_IER_UNDEF		(1 << 21)
/** SMC_IER_DTOE Data Timeout Error Interrupt Enable **/
#define SMC_IER_DTOE		(1 << 20)
/** SMC_IER_CMDDONE Command Done Interrupt Enable **/
#define SMC_IER_CMDDONE		(1 << 17)
/** SMC_IER_XFRDONE Transfer Done Interrupt Enable **/
#define SMC_IER_XFRDONE		(1 << 16)
/** SMC_IER_RB_FALL Ready Busy Falling Edge Detection Interrupt Enable **/
#define SMC_IER_RB_FALL		(1 << 5)
/** SMC_IER_RB_RISE Ready Busy Rising Edge Detection Interrupt Enable **/
#define SMC_IER_RB_RISE		(1 << 4)

/**@}*/

/** @defgroup smc_idr IDR SMC NFC Interrupt Disable Register
@{*/

/** SMC_IDR_RB_EDGE0 Ready/Busy Line 0 Interrupt Disable **/
#define SMC_IDR_RB_EDGE0		(1 << 24)
/** SMC_IDR_NFCASE NFC Access Size Error Interrupt Disable **/
#define SMC_IDR_NFCASE		(1 << 23)
/** SMC_IDR_AWB Accessing While Busy Interrupt Disable **/
#define SMC_IDR_AWB		(1 << 22)
/** SMC_IDR_UNDEF Undefined Area Access Interrupt Disable **/
#define SMC_IDR_UNDEF		(1 << 21)
/** SMC_IDR_DTOE Data Timeout Error Interrupt Disable **/
#define SMC_IDR_DTOE		(1 << 20)
/** SMC_IDR_CMDDONE Command Done Interrupt Disable **/
#define SMC_IDR_CMDDONE		(1 << 17)
/** SMC_IDR_XFRDONE Transfer Done Interrupt Disable **/
#define SMC_IDR_XFRDONE		(1 << 16)
/** SMC_IDR_RB_FALL Ready Busy Falling Edge Detection Interrupt Disable **/
#define SMC_IDR_RB_FALL		(1 << 5)
/** SMC_IDR_RB_RISE Ready Busy Rising Edge Detection Interrupt Disable **/
#define SMC_IDR_RB_RISE		(1 << 4)

/**@}*/

/** @defgroup smc_imr IMR SMC NFC Interrupt Mask Register
@{*/

/** SMC_IMR_RB_EDGE0 Ready/Busy Line 0 Interrupt Mask **/
#define SMC_IMR_RB_EDGE0		(1 << 24)
/** SMC_IMR_NFCASE NFC Access Size Error Interrupt Mask **/
#define SMC_IMR_NFCASE		(1 << 23)
/** SMC_IMR_AWB Accessing While Busy Interrupt Mask **/
#define SMC_IMR_AWB		(1 << 22)
/** SMC_IMR_UNDEF Undefined Area Access Interrupt Mask5 **/
#define SMC_IMR_UNDEF		(1 << 21)
/** SMC_IMR_DTOE Data Timeout Error Interrupt Mask **/
#define SMC_IMR_DTOE		(1 << 20)
/** SMC_IMR_CMDDONE Command Done Interrupt Mask **/
#define SMC_IMR_CMDDONE		(1 << 17)
/** SMC_IMR_XFRDONE Transfer Done Interrupt Mask **/
#define SMC_IMR_XFRDONE		(1 << 16)
/** SMC_IMR_RB_FALL Ready Busy Falling Edge Detection Interrupt Mask **/
#define SMC_IMR_RB_FALL		(1 << 5)
/** SMC_IMR_RB_RISE Ready Busy Rising Edge Detection Interrupt Mask **/
#define SMC_IMR_RB_RISE		(1 << 4)

/**@}*/

/** @defgroup smc_addr ADDR SMC NFC Address Cycle Zero Register
@{*/


#define SMC_ADDR_ADDR_CYCLE0_SHIFT		0
#define SMC_ADDR_ADDR_CYCLE0_MASK		0xff
/** @defgroup smc_addr_addr_cycle0 ADDRCYCLE0 NAND Flash Array Address cycle 0
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_bank BANK SMC Bank Address Register
@{*/


#define SMC_BANK_BANK_SHIFT		0
#define SMC_BANK_BANK_MASK		0x07
/** @defgroup smc_bank_bank BANK Bank Identifier
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_ctrl ECCCTRL SMC ECC Control Register
@{*/

/** SMC_ECC_CTRL_SWRST Software Reset **/
#define SMC_ECC_CTRL_SWRST		(1 << 1)
/** SMC_ECC_CTRL_RST Reset ECC **/
#define SMC_ECC_CTRL_RST		(1 << 0)

/**@}*/

/** @defgroup smc_ecc_md ECCMD SMC ECC Mode Register
@{*/


#define SMC_ECC_MD_TYPCORREC_SHIFT		4
#define SMC_ECC_MD_TYPCORREC_MASK		0x03
/** @defgroup smc_ecc_md_typcorrec TYPCORREC Type of Correction
@{*/
/**@}*/


#define SMC_ECC_MD_ECC_PAGESIZE_SHIFT		0
#define SMC_ECC_MD_ECC_PAGESIZE_MASK		0x03
/** @defgroup smc_ecc_md_ecc_pagesize ECCPAGESIZE ECC Page Size
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_sr1 ECCSR1 SMC ECC Status 1 Register
@{*/

