grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
/** SMC_ECC_SR1_MULERR7 Multiple Error in the page between the 1792nd and the 2047th bytes or between the 3584th and the 4095th bytes **/
#define SMC_ECC_SR1_MULERR7		(1 << 30)
/** SMC_ECC_SR1_ECCERR7 ECC Error in the page between the 1792nd and the 2047th bytes or between the 3584th and the 4095th bytes **/
#define SMC_ECC_SR1_ECCERR7		(1 << 29)
/** SMC_ECC_SR1_RECERR7 Recoverable Error in the page between the 1792nd and the 2047th bytes or between the 3584th and the 4095th bytes **/
#define SMC_ECC_SR1_RECERR7		(1 << 28)
/** SMC_ECC_SR1_MULERR6 Multiple Error in the page between the 1536th and the 1791st bytes or between the 3072nd and the 3583rd bytes **/
#define SMC_ECC_SR1_MULERR6		(1 << 26)
/** SMC_ECC_SR1_ECCERR6 ECC Error in the page between the 1536th and the 1791st bytes or between the 3072nd and the 3583rd bytes **/
#define SMC_ECC_SR1_ECCERR6		(1 << 25)
/** SMC_ECC_SR1_RECERR6 Recoverable Error in the page between the 1536th and the 1791st bytes or between the 3072nd and the 3583rd bytes **/
#define SMC_ECC_SR1_RECERR6		(1 << 24)
/** SMC_ECC_SR1_MULERR5 Multiple Error in the page between the 1280th and the 1535th bytes or between the 2560th and the 3071st bytes **/
#define SMC_ECC_SR1_MULERR5		(1 << 22)
/** SMC_ECC_SR1_ECCERR5 ECC Error in the page between the 1280th and the 1535th bytes or between the 2560th and the 3071st bytes **/
#define SMC_ECC_SR1_ECCERR5		(1 << 21)
/** SMC_ECC_SR1_RECERR5 Recoverable Error in the page between the 1280th and the 1535th bytes or between the 2560th and the 3071st bytes **/
#define SMC_ECC_SR1_RECERR5		(1 << 20)
/** SMC_ECC_SR1_MULERR4 Multiple Error in the page between the 1024th and the 1279th bytes or between the 2048th and the 2559th bytes **/
#define SMC_ECC_SR1_MULERR4		(1 << 18)
/** SMC_ECC_SR1_ECCERR4 ECC Error in the page between the 1024th and the 1279th bytes or between the 2048th and the 2559th bytes **/
#define SMC_ECC_SR1_ECCERR4		(1 << 17)
/** SMC_ECC_SR1_RECERR4 Recoverable Error in the page between the 1024th and the 1279th bytes or between the 2048th and the 2559th bytes **/
#define SMC_ECC_SR1_RECERR4		(1 << 16)
/** SMC_ECC_SR1_MULERR3 Multiple Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes **/
#define SMC_ECC_SR1_MULERR3		(1 << 14)
/** SMC_ECC_SR1_ECCERR3 ECC Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes **/
#define SMC_ECC_SR1_ECCERR3		(1 << 13)
/** SMC_ECC_SR1_RECERR3 Recoverable Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes **/
#define SMC_ECC_SR1_RECERR3		(1 << 12)
/** SMC_ECC_SR1_MULERR2 Multiple Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes **/
#define SMC_ECC_SR1_MULERR2		(1 << 10)
/** SMC_ECC_SR1_ECCERR2 ECC Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes **/
#define SMC_ECC_SR1_ECCERR2		(1 << 9)
/** SMC_ECC_SR1_RECERR2 Recoverable Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes **/
#define SMC_ECC_SR1_RECERR2		(1 << 8)
/** SMC_ECC_SR1_MULERR1 Multiple Error in the page between the 256th and the 511th bytes or between the 512nd and the 1023rd bytes **/
#define SMC_ECC_SR1_MULERR1		(1 << 6)
/** SMC_ECC_SR1_ECCERR1 ECC Error in the page between the 256th and the 511th bytes or between the 512nd and the 1023rd bytes **/
#define SMC_ECC_SR1_ECCERR1		(1 << 5)
/** SMC_ECC_SR1_RECERR1 Recoverable Error in the page between the 256th and the 511th bytes or the 512nd and the 1023rd bytes **/
#define SMC_ECC_SR1_RECERR1		(1 << 4)
/** SMC_ECC_SR1_MULERR0 Multiple Error **/
#define SMC_ECC_SR1_MULERR0		(1 << 2)
/** SMC_ECC_SR1_ECCERR0 ECC Error **/
#define SMC_ECC_SR1_ECCERR0		(1 << 1)
/** SMC_ECC_SR1_RECERR0 Recoverable Error **/
#define SMC_ECC_SR1_RECERR0		(1 << 0)

/**@}*/

/** @defgroup smc_ecc_pr0 ECCPR0 SMC ECC Parity 0 Register
@{*/


#define SMC_ECC_PR0_WORDADDR_SHIFT		4
#define SMC_ECC_PR0_WORDADDR_MASK		0xfff
/** @defgroup smc_ecc_pr0_wordaddr WORDADDR Word Address
@{*/
/**@}*/


#define SMC_ECC_PR0_BITADDR_SHIFT		0
#define SMC_ECC_PR0_BITADDR_MASK		0x0f
/** @defgroup smc_ecc_pr0_bitaddr BITADDR Bit Address
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr0_w9bit ECCPR0W9BIT SMC ECC Parity 0 Register
@{*/


#define SMC_ECC_PR0_W9BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR0_W9BIT_NPARITY_MASK		0xfff
/** @defgroup smc_ecc_pr0_w9bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR0_W9BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR0_W9BIT_WORDADDR_MASK		0x1ff
/** @defgroup smc_ecc_pr0_w9bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR0_W9BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR0_W9BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr0_w9bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr0_w8bit ECCPR0W8BIT SMC ECC Parity 0 Register
@{*/


#define SMC_ECC_PR0_W8BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR0_W8BIT_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr0_w8bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR0_W8BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR0_W8BIT_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr0_w8bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR0_W8BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR0_W8BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr0_w8bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr1 ECCPR1 SMC ECC parity 1 Register
@{*/


#define SMC_ECC_PR1_NPARITY_SHIFT		0
#define SMC_ECC_PR1_NPARITY_MASK		0xffff
/** @defgroup smc_ecc_pr1_nparity NPARITY Parity N
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr1_w9bit ECCPR1W9BIT SMC ECC parity 1 Register
@{*/


#define SMC_ECC_PR1_W9BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR1_W9BIT_NPARITY_MASK		0xfff
/** @defgroup smc_ecc_pr1_w9bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR1_W9BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR1_W9BIT_WORDADDR_MASK		0x1ff
/** @defgroup smc_ecc_pr1_w9bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR1_W9BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR1_W9BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr1_w9bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr1_w8bit ECCPR1W8BIT SMC ECC parity 1 Register
@{*/


#define SMC_ECC_PR1_W8BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR1_W8BIT_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr1_w8bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR1_W8BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR1_W8BIT_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr1_w8bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR1_W8BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR1_W8BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr1_w8bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_sr2 ECCSR2 SMC ECC status 2 Register
@{*/

/** SMC_ECC_SR2_MULERR15 Multiple Error in the page between the 3840th and the 4095th bytes **/
#define SMC_ECC_SR2_MULERR15		(1 << 30)
/** SMC_ECC_SR2_ECCERR15 ECC Error in the page between the 3840th and the 4095th bytes **/
#define SMC_ECC_SR2_ECCERR15		(1 << 29)
/** SMC_ECC_SR2_RECERR15 Recoverable Error in the page between the 3840th and the 4095th bytes **/
#define SMC_ECC_SR2_RECERR15		(1 << 28)
/** SMC_ECC_SR2_MULERR14 Multiple Error in the page between the 3584th and the 3839th bytes **/
#define SMC_ECC_SR2_MULERR14		(1 << 26)
/** SMC_ECC_SR2_ECCERR14 ECC Error in the page between the 3584th and the 3839th bytes **/
#define SMC_ECC_SR2_ECCERR14		(1 << 25)
/** SMC_ECC_SR2_RECERR14 Recoverable Error in the page between the 3584th and the 3839th bytes **/
#define SMC_ECC_SR2_RECERR14		(1 << 24)
/** SMC_ECC_SR2_MULERR13 Multiple Error in the page between the 3328th and the 3583rd bytes **/
#define SMC_ECC_SR2_MULERR13		(1 << 22)
/** SMC_ECC_SR2_ECCERR13 ECC Error in the page between the 3328th and the 3583rd bytes **/
#define SMC_ECC_SR2_ECCERR13		(1 << 21)
/** SMC_ECC_SR2_RECERR13 Recoverable Error in the page between the 3328th and the 3583rd bytes **/
#define SMC_ECC_SR2_RECERR13		(1 << 20)
/** SMC_ECC_SR2_MULERR12 Multiple Error in the page between the 3072nd and the 3327th bytes **/
#define SMC_ECC_SR2_MULERR12		(1 << 18)
/** SMC_ECC_SR2_ECCERR12 ECC Error in the page between the 3072nd and the 3327th bytes **/
#define SMC_ECC_SR2_ECCERR12		(1 << 17)
/** SMC_ECC_SR2_RECERR12 Recoverable Error in the page between the 3072nd and the 3327th bytes **/
#define SMC_ECC_SR2_RECERR12		(1 << 16)
/** SMC_ECC_SR2_MULERR11 Multiple Error in the page between the 2816th and the 3071st bytes **/
#define SMC_ECC_SR2_MULERR11		(1 << 14)
/** SMC_ECC_SR2_ECCERR11 ECC Error in the page between the 2816th and the 3071st bytes **/
#define SMC_ECC_SR2_ECCERR11		(1 << 13)
/** SMC_ECC_SR2_RECERR11 Recoverable Error in the page between the 2816th and the 3071st bytes **/
#define SMC_ECC_SR2_RECERR11		(1 << 12)
/** SMC_ECC_SR2_MULERR10 Multiple Error in the page between the 2560th and the 2815th bytes **/
#define SMC_ECC_SR2_MULERR10		(1 << 10)
/** SMC_ECC_SR2_ECCERR10 ECC Error in the page between the 2560th and the 2815th bytes **/
#define SMC_ECC_SR2_ECCERR10		(1 << 9)
/** SMC_ECC_SR2_RECERR10 Recoverable Error in the page between the 2560th and the 2815th bytes **/
#define SMC_ECC_SR2_RECERR10		(1 << 8)
/** SMC_ECC_SR2_MULERR9 Multiple Error in the page between the 2304th and the 2559th bytes **/
#define SMC_ECC_SR2_MULERR9		(1 << 6)
/** SMC_ECC_SR2_ECCERR9 ECC Error in the page between the 2304th and the 2559th bytes **/
#define SMC_ECC_SR2_ECCERR9		(1 << 5)
/** SMC_ECC_SR2_RECERR9 Recoverable Error in the page between the 2304th and the 2559th bytes **/
#define SMC_ECC_SR2_RECERR9		(1 << 4)
/** SMC_ECC_SR2_MULERR8 Multiple Error in the page between the 2048th and the 2303rd bytes **/
#define SMC_ECC_SR2_MULERR8		(1 << 2)
/** SMC_ECC_SR2_ECCERR8 ECC Error in the page between the 2048th and the 2303rd bytes **/
#define SMC_ECC_SR2_ECCERR8		(1 << 1)
/** SMC_ECC_SR2_RECERR8 Recoverable Error in the page between the 2048th and the 2303rd bytes **/
#define SMC_ECC_SR2_RECERR8		(1 << 0)

/**@}*/

