grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
/** @defgroup smc_ecc_pr2 ECCPR2 SMC ECC parity 2 Register
@{*/


#define SMC_ECC_PR2_NPARITY_SHIFT		12
#define SMC_ECC_PR2_NPARITY_MASK		0xfff
/** @defgroup smc_ecc_pr2_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR2_WORDADDR_SHIFT		3
#define SMC_ECC_PR2_WORDADDR_MASK		0x1ff
/** @defgroup smc_ecc_pr2_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR2_BITADDR_SHIFT		0
#define SMC_ECC_PR2_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr2_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr2_w8bit ECCPR2W8BIT SMC ECC parity 2 Register
@{*/


#define SMC_ECC_PR2_W8BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR2_W8BIT_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr2_w8bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR2_W8BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR2_W8BIT_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr2_w8bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR2_W8BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR2_W8BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr2_w8bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr3 ECCPR3 SMC ECC parity 3 Register
@{*/


#define SMC_ECC_PR3_NPARITY_SHIFT		12
#define SMC_ECC_PR3_NPARITY_MASK		0xfff
/** @defgroup smc_ecc_pr3_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR3_WORDADDR_SHIFT		3
#define SMC_ECC_PR3_WORDADDR_MASK		0x1ff
/** @defgroup smc_ecc_pr3_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR3_BITADDR_SHIFT		0
#define SMC_ECC_PR3_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr3_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr3_w8bit ECCPR3W8BIT SMC ECC parity 3 Register
@{*/


#define SMC_ECC_PR3_W8BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR3_W8BIT_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr3_w8bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR3_W8BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR3_W8BIT_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr3_w8bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR3_W8BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR3_W8BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr3_w8bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr4 ECCPR4 SMC ECC parity 4 Register
@{*/


#define SMC_ECC_PR4_NPARITY_SHIFT		12
#define SMC_ECC_PR4_NPARITY_MASK		0xfff
/** @defgroup smc_ecc_pr4_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR4_WORDADDR_SHIFT		3
#define SMC_ECC_PR4_WORDADDR_MASK		0x1ff
/** @defgroup smc_ecc_pr4_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR4_BITADDR_SHIFT		0
#define SMC_ECC_PR4_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr4_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr4_w8bit ECCPR4W8BIT SMC ECC parity 4 Register
@{*/


#define SMC_ECC_PR4_W8BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR4_W8BIT_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr4_w8bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR4_W8BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR4_W8BIT_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr4_w8bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR4_W8BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR4_W8BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr4_w8bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr5 ECCPR5 SMC ECC parity 5 Register
@{*/


#define SMC_ECC_PR5_NPARITY_SHIFT		12
#define SMC_ECC_PR5_NPARITY_MASK		0xfff
/** @defgroup smc_ecc_pr5_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR5_WORDADDR_SHIFT		3
#define SMC_ECC_PR5_WORDADDR_MASK		0x1ff
/** @defgroup smc_ecc_pr5_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR5_BITADDR_SHIFT		0
#define SMC_ECC_PR5_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr5_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr5_w8bit ECCPR5W8BIT SMC ECC parity 5 Register
@{*/


#define SMC_ECC_PR5_W8BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR5_W8BIT_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr5_w8bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR5_W8BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR5_W8BIT_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr5_w8bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR5_W8BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR5_W8BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr5_w8bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr6 ECCPR6 SMC ECC parity 6 Register
@{*/


#define SMC_ECC_PR6_NPARITY_SHIFT		12
#define SMC_ECC_PR6_NPARITY_MASK		0xfff
/** @defgroup smc_ecc_pr6_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR6_WORDADDR_SHIFT		3
#define SMC_ECC_PR6_WORDADDR_MASK		0x1ff
/** @defgroup smc_ecc_pr6_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR6_BITADDR_SHIFT		0
#define SMC_ECC_PR6_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr6_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr6_w8bit ECCPR6W8BIT SMC ECC parity 6 Register
@{*/


#define SMC_ECC_PR6_W8BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR6_W8BIT_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr6_w8bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR6_W8BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR6_W8BIT_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr6_w8bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR6_W8BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR6_W8BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr6_w8bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr7 ECCPR7 SMC ECC parity 7 Register
@{*/


#define SMC_ECC_PR7_NPARITY_SHIFT		12
#define SMC_ECC_PR7_NPARITY_MASK		0xfff
/** @defgroup smc_ecc_pr7_nparity NPARITY Parity N
@{*/
/**@}*/


