grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
#define SMC_ECC_PR7_WORDADDR_SHIFT		3
#define SMC_ECC_PR7_WORDADDR_MASK		0x1ff
/** @defgroup smc_ecc_pr7_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR7_BITADDR_SHIFT		0
#define SMC_ECC_PR7_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr7_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr7_w8bit ECCPR7W8BIT SMC ECC parity 7 Register
@{*/


#define SMC_ECC_PR7_W8BIT_NPARITY_SHIFT		12
#define SMC_ECC_PR7_W8BIT_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr7_w8bit_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR7_W8BIT_WORDADDR_SHIFT		3
#define SMC_ECC_PR7_W8BIT_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr7_w8bit_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR7_W8BIT_BITADDR_SHIFT		0
#define SMC_ECC_PR7_W8BIT_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr7_w8bit_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr8 ECCPR8 SMC ECC parity 8 Register
@{*/


#define SMC_ECC_PR8_NPARITY_SHIFT		12
#define SMC_ECC_PR8_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr8_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR8_WORDADDR_SHIFT		3
#define SMC_ECC_PR8_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr8_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR8_BITADDR_SHIFT		0
#define SMC_ECC_PR8_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr8_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr9 ECCPR9 SMC ECC parity 9 Register
@{*/


#define SMC_ECC_PR9_NPARITY_SHIFT		12
#define SMC_ECC_PR9_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr9_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR9_WORDADDR_SHIFT		3
#define SMC_ECC_PR9_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr9_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR9_BITADDR_SHIFT		0
#define SMC_ECC_PR9_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr9_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr10 ECCPR10 SMC ECC parity 10 Register
@{*/


#define SMC_ECC_PR10_NPARITY_SHIFT		12
#define SMC_ECC_PR10_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr10_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR10_WORDADDR_SHIFT		3
#define SMC_ECC_PR10_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr10_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR10_BITADDR_SHIFT		0
#define SMC_ECC_PR10_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr10_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr11 ECCPR11 SMC ECC parity 11 Register
@{*/


#define SMC_ECC_PR11_NPARITY_SHIFT		12
#define SMC_ECC_PR11_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr11_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR11_WORDADDR_SHIFT		3
#define SMC_ECC_PR11_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr11_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR11_BITADDR_SHIFT		0
#define SMC_ECC_PR11_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr11_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr12 ECCPR12 SMC ECC parity 12 Register
@{*/


#define SMC_ECC_PR12_NPARITY_SHIFT		12
#define SMC_ECC_PR12_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr12_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR12_WORDADDR_SHIFT		3
#define SMC_ECC_PR12_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr12_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR12_BITADDR_SHIFT		0
#define SMC_ECC_PR12_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr12_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr13 ECCPR13 SMC ECC parity 13 Register
@{*/


#define SMC_ECC_PR13_NPARITY_SHIFT		12
#define SMC_ECC_PR13_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr13_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR13_WORDADDR_SHIFT		3
#define SMC_ECC_PR13_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr13_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR13_BITADDR_SHIFT		0
#define SMC_ECC_PR13_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr13_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr14 ECCPR14 SMC ECC parity 14 Register
@{*/


#define SMC_ECC_PR14_NPARITY_SHIFT		12
#define SMC_ECC_PR14_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr14_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR14_WORDADDR_SHIFT		3
#define SMC_ECC_PR14_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr14_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


#define SMC_ECC_PR14_BITADDR_SHIFT		0
#define SMC_ECC_PR14_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr14_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_ecc_pr15 ECCPR15 SMC ECC parity 15 Register
@{*/


#define SMC_ECC_PR15_NPARITY_SHIFT		12
#define SMC_ECC_PR15_NPARITY_MASK		0x7ff
/** @defgroup smc_ecc_pr15_nparity NPARITY Parity N
@{*/
/**@}*/


#define SMC_ECC_PR15_WORDADDR_SHIFT		3
#define SMC_ECC_PR15_WORDADDR_MASK		0xff
/** @defgroup smc_ecc_pr15_wordaddr WORDADDR Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


