grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
#define SMC_ECC_PR15_BITADDR_SHIFT		0
#define SMC_ECC_PR15_BITADDR_MASK		0x07
/** @defgroup smc_ecc_pr15_bitaddr BITADDR Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_setup0 SETUP0 SMC Setup Register (CS_number = 0)
@{*/


#define SMC_SETUP0_NCS_RD_SETUP_SHIFT		24
#define SMC_SETUP0_NCS_RD_SETUP_MASK		0x3f
/** @defgroup smc_setup0_ncs_rd_setup NCSRDSETUP NCS Setup Length in Read Access
@{*/
/**@}*/


#define SMC_SETUP0_NRD_SETUP_SHIFT		16
#define SMC_SETUP0_NRD_SETUP_MASK		0x3f
/** @defgroup smc_setup0_nrd_setup NRDSETUP NRD Setup Length
@{*/
/**@}*/


#define SMC_SETUP0_NCS_WR_SETUP_SHIFT		8
#define SMC_SETUP0_NCS_WR_SETUP_MASK		0x3f
/** @defgroup smc_setup0_ncs_wr_setup NCSWRSETUP NCS Setup Length in Write Access
@{*/
/**@}*/


#define SMC_SETUP0_NWE_SETUP_SHIFT		0
#define SMC_SETUP0_NWE_SETUP_MASK		0x3f
/** @defgroup smc_setup0_nwe_setup NWESETUP NWE Setup Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_pulse0 PULSE0 SMC Pulse Register (CS_number = 0)
@{*/


#define SMC_PULSE0_NCS_RD_PULSE_SHIFT		24
#define SMC_PULSE0_NCS_RD_PULSE_MASK		0x7f
/** @defgroup smc_pulse0_ncs_rd_pulse NCSRDPULSE NCS Pulse Length in READ Access
@{*/
/**@}*/


#define SMC_PULSE0_NRD_PULSE_SHIFT		16
#define SMC_PULSE0_NRD_PULSE_MASK		0x7f
/** @defgroup smc_pulse0_nrd_pulse NRDPULSE NRD Pulse Length
@{*/
/**@}*/


#define SMC_PULSE0_NCS_WR_PULSE_SHIFT		8
#define SMC_PULSE0_NCS_WR_PULSE_MASK		0x7f
/** @defgroup smc_pulse0_ncs_wr_pulse NCSWRPULSE NCS Pulse Length in WRITE Access
@{*/
/**@}*/


#define SMC_PULSE0_NWE_PULSE_SHIFT		0
#define SMC_PULSE0_NWE_PULSE_MASK		0x7f
/** @defgroup smc_pulse0_nwe_pulse NWEPULSE NWE Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_cycle0 CYCLE0 SMC Cycle Register (CS_number = 0)
@{*/


#define SMC_CYCLE0_NRD_CYCLE_SHIFT		16
#define SMC_CYCLE0_NRD_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle0_nrd_cycle NRDCYCLE Total Read Cycle Length
@{*/
/**@}*/


#define SMC_CYCLE0_NWE_CYCLE_SHIFT		0
#define SMC_CYCLE0_NWE_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle0_nwe_cycle NWECYCLE Total Write Cycle Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_timings0 TIMINGS0 SMC Timings Register (CS_number = 0)
@{*/

/** SMC_TIMINGS0_NFSEL NAND Flash Selection **/
#define SMC_TIMINGS0_NFSEL		(1 << 31)

#define SMC_TIMINGS0_RBNSEL_SHIFT		28
#define SMC_TIMINGS0_RBNSEL_MASK		0x07
/** @defgroup smc_timings0_rbnsel RBNSEL Ready/Busy Line Selection
@{*/
/**@}*/


#define SMC_TIMINGS0_TWB_SHIFT		24
#define SMC_TIMINGS0_TWB_MASK		0x0f
/** @defgroup smc_timings0_twb TWB WEN High to REN to Busy
@{*/
/**@}*/


#define SMC_TIMINGS0_TRR_SHIFT		16
#define SMC_TIMINGS0_TRR_MASK		0x0f
/** @defgroup smc_timings0_trr TRR Ready to REN Low Delay
@{*/
/**@}*/

/** SMC_TIMINGS0_OCMS Off Chip Memory Scrambling Enable **/
#define SMC_TIMINGS0_OCMS		(1 << 12)

#define SMC_TIMINGS0_TAR_SHIFT		8
#define SMC_TIMINGS0_TAR_MASK		0x0f
/** @defgroup smc_timings0_tar TAR ALE to REN Low Delay
@{*/
/**@}*/


#define SMC_TIMINGS0_TADL_SHIFT		4
#define SMC_TIMINGS0_TADL_MASK		0x0f
/** @defgroup smc_timings0_tadl TADL ALE to Data Start
@{*/
/**@}*/


#define SMC_TIMINGS0_TCLR_SHIFT		0
#define SMC_TIMINGS0_TCLR_MASK		0x0f
/** @defgroup smc_timings0_tclr TCLR CLE to REN Low Delay
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_mode0 MODE0 SMC Mode Register (CS_number = 0)
@{*/

/** SMC_MODE0_TDF_MODE TDF Optimization **/
#define SMC_MODE0_TDF_MODE		(1 << 20)

#define SMC_MODE0_TDF_CYCLES_SHIFT		16
#define SMC_MODE0_TDF_CYCLES_MASK		0x0f
/** @defgroup smc_mode0_tdf_cycles TDFCYCLES Data Float Time
@{*/
/**@}*/

/** SMC_MODE0_DBW Data Bus Width **/
#define SMC_MODE0_DBW		(1 << 12)
/** SMC_MODE0_BAT Byte Access Type **/
#define SMC_MODE0_BAT		(1 << 8)

#define SMC_MODE0_EXNW_MODE_SHIFT		4
#define SMC_MODE0_EXNW_MODE_MASK		0x03
/** @defgroup smc_mode0_exnw_mode EXNWMODE NWAIT Mode
@{*/
/**@}*/

/** SMC_MODE0_WRITE_MODE Selection of the Control Signal for Write Operation **/
#define SMC_MODE0_WRITE_MODE		(1 << 1)
/** SMC_MODE0_READ_MODE Selection of the Control Signal for Read Operation **/
#define SMC_MODE0_READ_MODE		(1 << 0)

/**@}*/

/** @defgroup smc_setup1 SETUP1 SMC Setup Register (CS_number = 1)
@{*/


#define SMC_SETUP1_NCS_RD_SETUP_SHIFT		24
#define SMC_SETUP1_NCS_RD_SETUP_MASK		0x3f
/** @defgroup smc_setup1_ncs_rd_setup NCSRDSETUP NCS Setup Length in Read Access
@{*/
/**@}*/


#define SMC_SETUP1_NRD_SETUP_SHIFT		16
#define SMC_SETUP1_NRD_SETUP_MASK		0x3f
/** @defgroup smc_setup1_nrd_setup NRDSETUP NRD Setup Length
@{*/
/**@}*/


#define SMC_SETUP1_NCS_WR_SETUP_SHIFT		8
#define SMC_SETUP1_NCS_WR_SETUP_MASK		0x3f
/** @defgroup smc_setup1_ncs_wr_setup NCSWRSETUP NCS Setup Length in Write Access
@{*/
/**@}*/


#define SMC_SETUP1_NWE_SETUP_SHIFT		0
#define SMC_SETUP1_NWE_SETUP_MASK		0x3f
/** @defgroup smc_setup1_nwe_setup NWESETUP NWE Setup Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_pulse1 PULSE1 SMC Pulse Register (CS_number = 1)
@{*/


#define SMC_PULSE1_NCS_RD_PULSE_SHIFT		24
#define SMC_PULSE1_NCS_RD_PULSE_MASK		0x7f
/** @defgroup smc_pulse1_ncs_rd_pulse NCSRDPULSE NCS Pulse Length in READ Access
@{*/
/**@}*/


#define SMC_PULSE1_NRD_PULSE_SHIFT		16
#define SMC_PULSE1_NRD_PULSE_MASK		0x7f
/** @defgroup smc_pulse1_nrd_pulse NRDPULSE NRD Pulse Length
@{*/
/**@}*/


#define SMC_PULSE1_NCS_WR_PULSE_SHIFT		8
#define SMC_PULSE1_NCS_WR_PULSE_MASK		0x7f
/** @defgroup smc_pulse1_ncs_wr_pulse NCSWRPULSE NCS Pulse Length in WRITE Access
@{*/
/**@}*/


#define SMC_PULSE1_NWE_PULSE_SHIFT		0
#define SMC_PULSE1_NWE_PULSE_MASK		0x7f
/** @defgroup smc_pulse1_nwe_pulse NWEPULSE NWE Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_cycle1 CYCLE1 SMC Cycle Register (CS_number = 1)
@{*/


#define SMC_CYCLE1_NRD_CYCLE_SHIFT		16
#define SMC_CYCLE1_NRD_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle1_nrd_cycle NRDCYCLE Total Read Cycle Length
@{*/
/**@}*/


#define SMC_CYCLE1_NWE_CYCLE_SHIFT		0
#define SMC_CYCLE1_NWE_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle1_nwe_cycle NWECYCLE Total Write Cycle Length
@{*/
/**@}*/


/**@}*/

