grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
/** @defgroup smc_timings1 TIMINGS1 SMC Timings Register (CS_number = 1)
@{*/

/** SMC_TIMINGS1_NFSEL NAND Flash Selection **/
#define SMC_TIMINGS1_NFSEL		(1 << 31)

#define SMC_TIMINGS1_RBNSEL_SHIFT		28
#define SMC_TIMINGS1_RBNSEL_MASK		0x07
/** @defgroup smc_timings1_rbnsel RBNSEL Ready/Busy Line Selection
@{*/
/**@}*/


#define SMC_TIMINGS1_TWB_SHIFT		24
#define SMC_TIMINGS1_TWB_MASK		0x0f
/** @defgroup smc_timings1_twb TWB WEN High to REN to Busy
@{*/
/**@}*/


#define SMC_TIMINGS1_TRR_SHIFT		16
#define SMC_TIMINGS1_TRR_MASK		0x0f
/** @defgroup smc_timings1_trr TRR Ready to REN Low Delay
@{*/
/**@}*/

/** SMC_TIMINGS1_OCMS Off Chip Memory Scrambling Enable **/
#define SMC_TIMINGS1_OCMS		(1 << 12)

#define SMC_TIMINGS1_TAR_SHIFT		8
#define SMC_TIMINGS1_TAR_MASK		0x0f
/** @defgroup smc_timings1_tar TAR ALE to REN Low Delay
@{*/
/**@}*/


#define SMC_TIMINGS1_TADL_SHIFT		4
#define SMC_TIMINGS1_TADL_MASK		0x0f
/** @defgroup smc_timings1_tadl TADL ALE to Data Start
@{*/
/**@}*/


#define SMC_TIMINGS1_TCLR_SHIFT		0
#define SMC_TIMINGS1_TCLR_MASK		0x0f
/** @defgroup smc_timings1_tclr TCLR CLE to REN Low Delay
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_mode1 MODE1 SMC Mode Register (CS_number = 1)
@{*/

/** SMC_MODE1_TDF_MODE TDF Optimization **/
#define SMC_MODE1_TDF_MODE		(1 << 20)

#define SMC_MODE1_TDF_CYCLES_SHIFT		16
#define SMC_MODE1_TDF_CYCLES_MASK		0x0f
/** @defgroup smc_mode1_tdf_cycles TDFCYCLES Data Float Time
@{*/
/**@}*/

/** SMC_MODE1_DBW Data Bus Width **/
#define SMC_MODE1_DBW		(1 << 12)
/** SMC_MODE1_BAT Byte Access Type **/
#define SMC_MODE1_BAT		(1 << 8)

#define SMC_MODE1_EXNW_MODE_SHIFT		4
#define SMC_MODE1_EXNW_MODE_MASK		0x03
/** @defgroup smc_mode1_exnw_mode EXNWMODE NWAIT Mode
@{*/
/**@}*/

/** SMC_MODE1_WRITE_MODE Selection of the Control Signal for Write Operation **/
#define SMC_MODE1_WRITE_MODE		(1 << 1)
/** SMC_MODE1_READ_MODE Selection of the Control Signal for Read Operation **/
#define SMC_MODE1_READ_MODE		(1 << 0)

/**@}*/

/** @defgroup smc_setup2 SETUP2 SMC Setup Register (CS_number = 2)
@{*/


#define SMC_SETUP2_NCS_RD_SETUP_SHIFT		24
#define SMC_SETUP2_NCS_RD_SETUP_MASK		0x3f
/** @defgroup smc_setup2_ncs_rd_setup NCSRDSETUP NCS Setup Length in Read Access
@{*/
/**@}*/


#define SMC_SETUP2_NRD_SETUP_SHIFT		16
#define SMC_SETUP2_NRD_SETUP_MASK		0x3f
/** @defgroup smc_setup2_nrd_setup NRDSETUP NRD Setup Length
@{*/
/**@}*/


#define SMC_SETUP2_NCS_WR_SETUP_SHIFT		8
#define SMC_SETUP2_NCS_WR_SETUP_MASK		0x3f
/** @defgroup smc_setup2_ncs_wr_setup NCSWRSETUP NCS Setup Length in Write Access
@{*/
/**@}*/


#define SMC_SETUP2_NWE_SETUP_SHIFT		0
#define SMC_SETUP2_NWE_SETUP_MASK		0x3f
/** @defgroup smc_setup2_nwe_setup NWESETUP NWE Setup Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_pulse2 PULSE2 SMC Pulse Register (CS_number = 2)
@{*/


#define SMC_PULSE2_NCS_RD_PULSE_SHIFT		24
#define SMC_PULSE2_NCS_RD_PULSE_MASK		0x7f
/** @defgroup smc_pulse2_ncs_rd_pulse NCSRDPULSE NCS Pulse Length in READ Access
@{*/
/**@}*/


#define SMC_PULSE2_NRD_PULSE_SHIFT		16
#define SMC_PULSE2_NRD_PULSE_MASK		0x7f
/** @defgroup smc_pulse2_nrd_pulse NRDPULSE NRD Pulse Length
@{*/
/**@}*/


#define SMC_PULSE2_NCS_WR_PULSE_SHIFT		8
#define SMC_PULSE2_NCS_WR_PULSE_MASK		0x7f
/** @defgroup smc_pulse2_ncs_wr_pulse NCSWRPULSE NCS Pulse Length in WRITE Access
@{*/
/**@}*/


#define SMC_PULSE2_NWE_PULSE_SHIFT		0
#define SMC_PULSE2_NWE_PULSE_MASK		0x7f
/** @defgroup smc_pulse2_nwe_pulse NWEPULSE NWE Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_cycle2 CYCLE2 SMC Cycle Register (CS_number = 2)
@{*/


#define SMC_CYCLE2_NRD_CYCLE_SHIFT		16
#define SMC_CYCLE2_NRD_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle2_nrd_cycle NRDCYCLE Total Read Cycle Length
@{*/
/**@}*/


#define SMC_CYCLE2_NWE_CYCLE_SHIFT		0
#define SMC_CYCLE2_NWE_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle2_nwe_cycle NWECYCLE Total Write Cycle Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_timings2 TIMINGS2 SMC Timings Register (CS_number = 2)
@{*/

/** SMC_TIMINGS2_NFSEL NAND Flash Selection **/
#define SMC_TIMINGS2_NFSEL		(1 << 31)

#define SMC_TIMINGS2_RBNSEL_SHIFT		28
#define SMC_TIMINGS2_RBNSEL_MASK		0x07
/** @defgroup smc_timings2_rbnsel RBNSEL Ready/Busy Line Selection
@{*/
/**@}*/


#define SMC_TIMINGS2_TWB_SHIFT		24
#define SMC_TIMINGS2_TWB_MASK		0x0f
/** @defgroup smc_timings2_twb TWB WEN High to REN to Busy
@{*/
/**@}*/


#define SMC_TIMINGS2_TRR_SHIFT		16
#define SMC_TIMINGS2_TRR_MASK		0x0f
/** @defgroup smc_timings2_trr TRR Ready to REN Low Delay
@{*/
/**@}*/

/** SMC_TIMINGS2_OCMS Off Chip Memory Scrambling Enable **/
#define SMC_TIMINGS2_OCMS		(1 << 12)

#define SMC_TIMINGS2_TAR_SHIFT		8
#define SMC_TIMINGS2_TAR_MASK		0x0f
/** @defgroup smc_timings2_tar TAR ALE to REN Low Delay
@{*/
/**@}*/


#define SMC_TIMINGS2_TADL_SHIFT		4
#define SMC_TIMINGS2_TADL_MASK		0x0f
/** @defgroup smc_timings2_tadl TADL ALE to Data Start
@{*/
/**@}*/


#define SMC_TIMINGS2_TCLR_SHIFT		0
#define SMC_TIMINGS2_TCLR_MASK		0x0f
/** @defgroup smc_timings2_tclr TCLR CLE to REN Low Delay
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_mode2 MODE2 SMC Mode Register (CS_number = 2)
@{*/

/** SMC_MODE2_TDF_MODE TDF Optimization **/
#define SMC_MODE2_TDF_MODE		(1 << 20)

#define SMC_MODE2_TDF_CYCLES_SHIFT		16
#define SMC_MODE2_TDF_CYCLES_MASK		0x0f
/** @defgroup smc_mode2_tdf_cycles TDFCYCLES Data Float Time
@{*/
/**@}*/

/** SMC_MODE2_DBW Data Bus Width **/
#define SMC_MODE2_DBW		(1 << 12)
/** SMC_MODE2_BAT Byte Access Type **/
#define SMC_MODE2_BAT		(1 << 8)

#define SMC_MODE2_EXNW_MODE_SHIFT		4
#define SMC_MODE2_EXNW_MODE_MASK		0x03
/** @defgroup smc_mode2_exnw_mode EXNWMODE NWAIT Mode
@{*/
/**@}*/

/** SMC_MODE2_WRITE_MODE Selection of the Control Signal for Write Operation **/
#define SMC_MODE2_WRITE_MODE		(1 << 1)
/** SMC_MODE2_READ_MODE Selection of the Control Signal for Read Operation **/
#define SMC_MODE2_READ_MODE		(1 << 0)

/**@}*/

/** @defgroup smc_setup3 SETUP3 SMC Setup Register (CS_number = 3)
@{*/


#define SMC_SETUP3_NCS_RD_SETUP_SHIFT		24
#define SMC_SETUP3_NCS_RD_SETUP_MASK		0x3f
/** @defgroup smc_setup3_ncs_rd_setup NCSRDSETUP NCS Setup Length in Read Access
@{*/
/**@}*/


