grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
#define SMC_SETUP3_NRD_SETUP_SHIFT		16
#define SMC_SETUP3_NRD_SETUP_MASK		0x3f
/** @defgroup smc_setup3_nrd_setup NRDSETUP NRD Setup Length
@{*/
/**@}*/


#define SMC_SETUP3_NCS_WR_SETUP_SHIFT		8
#define SMC_SETUP3_NCS_WR_SETUP_MASK		0x3f
/** @defgroup smc_setup3_ncs_wr_setup NCSWRSETUP NCS Setup Length in Write Access
@{*/
/**@}*/


#define SMC_SETUP3_NWE_SETUP_SHIFT		0
#define SMC_SETUP3_NWE_SETUP_MASK		0x3f
/** @defgroup smc_setup3_nwe_setup NWESETUP NWE Setup Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_pulse3 PULSE3 SMC Pulse Register (CS_number = 3)
@{*/


#define SMC_PULSE3_NCS_RD_PULSE_SHIFT		24
#define SMC_PULSE3_NCS_RD_PULSE_MASK		0x7f
/** @defgroup smc_pulse3_ncs_rd_pulse NCSRDPULSE NCS Pulse Length in READ Access
@{*/
/**@}*/


#define SMC_PULSE3_NRD_PULSE_SHIFT		16
#define SMC_PULSE3_NRD_PULSE_MASK		0x7f
/** @defgroup smc_pulse3_nrd_pulse NRDPULSE NRD Pulse Length
@{*/
/**@}*/


#define SMC_PULSE3_NCS_WR_PULSE_SHIFT		8
#define SMC_PULSE3_NCS_WR_PULSE_MASK		0x7f
/** @defgroup smc_pulse3_ncs_wr_pulse NCSWRPULSE NCS Pulse Length in WRITE Access
@{*/
/**@}*/


#define SMC_PULSE3_NWE_PULSE_SHIFT		0
#define SMC_PULSE3_NWE_PULSE_MASK		0x7f
/** @defgroup smc_pulse3_nwe_pulse NWEPULSE NWE Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_cycle3 CYCLE3 SMC Cycle Register (CS_number = 3)
@{*/


#define SMC_CYCLE3_NRD_CYCLE_SHIFT		16
#define SMC_CYCLE3_NRD_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle3_nrd_cycle NRDCYCLE Total Read Cycle Length
@{*/
/**@}*/


#define SMC_CYCLE3_NWE_CYCLE_SHIFT		0
#define SMC_CYCLE3_NWE_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle3_nwe_cycle NWECYCLE Total Write Cycle Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_timings3 TIMINGS3 SMC Timings Register (CS_number = 3)
@{*/

/** SMC_TIMINGS3_NFSEL NAND Flash Selection **/
#define SMC_TIMINGS3_NFSEL		(1 << 31)

#define SMC_TIMINGS3_RBNSEL_SHIFT		28
#define SMC_TIMINGS3_RBNSEL_MASK		0x07
/** @defgroup smc_timings3_rbnsel RBNSEL Ready/Busy Line Selection
@{*/
/**@}*/


#define SMC_TIMINGS3_TWB_SHIFT		24
#define SMC_TIMINGS3_TWB_MASK		0x0f
/** @defgroup smc_timings3_twb TWB WEN High to REN to Busy
@{*/
/**@}*/


#define SMC_TIMINGS3_TRR_SHIFT		16
#define SMC_TIMINGS3_TRR_MASK		0x0f
/** @defgroup smc_timings3_trr TRR Ready to REN Low Delay
@{*/
/**@}*/

/** SMC_TIMINGS3_OCMS Off Chip Memory Scrambling Enable **/
#define SMC_TIMINGS3_OCMS		(1 << 12)

#define SMC_TIMINGS3_TAR_SHIFT		8
#define SMC_TIMINGS3_TAR_MASK		0x0f
/** @defgroup smc_timings3_tar TAR ALE to REN Low Delay
@{*/
/**@}*/


#define SMC_TIMINGS3_TADL_SHIFT		4
#define SMC_TIMINGS3_TADL_MASK		0x0f
/** @defgroup smc_timings3_tadl TADL ALE to Data Start
@{*/
/**@}*/


#define SMC_TIMINGS3_TCLR_SHIFT		0
#define SMC_TIMINGS3_TCLR_MASK		0x0f
/** @defgroup smc_timings3_tclr TCLR CLE to REN Low Delay
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_mode3 MODE3 SMC Mode Register (CS_number = 3)
@{*/

/** SMC_MODE3_TDF_MODE TDF Optimization **/
#define SMC_MODE3_TDF_MODE		(1 << 20)

#define SMC_MODE3_TDF_CYCLES_SHIFT		16
#define SMC_MODE3_TDF_CYCLES_MASK		0x0f
/** @defgroup smc_mode3_tdf_cycles TDFCYCLES Data Float Time
@{*/
/**@}*/

/** SMC_MODE3_DBW Data Bus Width **/
#define SMC_MODE3_DBW		(1 << 12)
/** SMC_MODE3_BAT Byte Access Type **/
#define SMC_MODE3_BAT		(1 << 8)

#define SMC_MODE3_EXNW_MODE_SHIFT		4
#define SMC_MODE3_EXNW_MODE_MASK		0x03
/** @defgroup smc_mode3_exnw_mode EXNWMODE NWAIT Mode
@{*/
/**@}*/

/** SMC_MODE3_WRITE_MODE Selection of the Control Signal for Write Operation **/
#define SMC_MODE3_WRITE_MODE		(1 << 1)
/** SMC_MODE3_READ_MODE Selection of the Control Signal for Read Operation **/
#define SMC_MODE3_READ_MODE		(1 << 0)

/**@}*/

/** @defgroup smc_setup4 SETUP4 SMC Setup Register (CS_number = 4)
@{*/


#define SMC_SETUP4_NCS_RD_SETUP_SHIFT		24
#define SMC_SETUP4_NCS_RD_SETUP_MASK		0x3f
/** @defgroup smc_setup4_ncs_rd_setup NCSRDSETUP NCS Setup Length in Read Access
@{*/
/**@}*/


#define SMC_SETUP4_NRD_SETUP_SHIFT		16
#define SMC_SETUP4_NRD_SETUP_MASK		0x3f
/** @defgroup smc_setup4_nrd_setup NRDSETUP NRD Setup Length
@{*/
/**@}*/


#define SMC_SETUP4_NCS_WR_SETUP_SHIFT		8
#define SMC_SETUP4_NCS_WR_SETUP_MASK		0x3f
/** @defgroup smc_setup4_ncs_wr_setup NCSWRSETUP NCS Setup Length in Write Access
@{*/
/**@}*/


#define SMC_SETUP4_NWE_SETUP_SHIFT		0
#define SMC_SETUP4_NWE_SETUP_MASK		0x3f
/** @defgroup smc_setup4_nwe_setup NWESETUP NWE Setup Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_pulse4 PULSE4 SMC Pulse Register (CS_number = 4)
@{*/


#define SMC_PULSE4_NCS_RD_PULSE_SHIFT		24
#define SMC_PULSE4_NCS_RD_PULSE_MASK		0x7f
/** @defgroup smc_pulse4_ncs_rd_pulse NCSRDPULSE NCS Pulse Length in READ Access
@{*/
/**@}*/


#define SMC_PULSE4_NRD_PULSE_SHIFT		16
#define SMC_PULSE4_NRD_PULSE_MASK		0x7f
/** @defgroup smc_pulse4_nrd_pulse NRDPULSE NRD Pulse Length
@{*/
/**@}*/


#define SMC_PULSE4_NCS_WR_PULSE_SHIFT		8
#define SMC_PULSE4_NCS_WR_PULSE_MASK		0x7f
/** @defgroup smc_pulse4_ncs_wr_pulse NCSWRPULSE NCS Pulse Length in WRITE Access
@{*/
/**@}*/


#define SMC_PULSE4_NWE_PULSE_SHIFT		0
#define SMC_PULSE4_NWE_PULSE_MASK		0x7f
/** @defgroup smc_pulse4_nwe_pulse NWEPULSE NWE Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_cycle4 CYCLE4 SMC Cycle Register (CS_number = 4)
@{*/


#define SMC_CYCLE4_NRD_CYCLE_SHIFT		16
#define SMC_CYCLE4_NRD_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle4_nrd_cycle NRDCYCLE Total Read Cycle Length
@{*/
/**@}*/


#define SMC_CYCLE4_NWE_CYCLE_SHIFT		0
#define SMC_CYCLE4_NWE_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle4_nwe_cycle NWECYCLE Total Write Cycle Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_timings4 TIMINGS4 SMC Timings Register (CS_number = 4)
@{*/

/** SMC_TIMINGS4_NFSEL NAND Flash Selection **/
#define SMC_TIMINGS4_NFSEL		(1 << 31)

#define SMC_TIMINGS4_RBNSEL_SHIFT		28
#define SMC_TIMINGS4_RBNSEL_MASK		0x07
/** @defgroup smc_timings4_rbnsel RBNSEL Ready/Busy Line Selection
@{*/
/**@}*/


#define SMC_TIMINGS4_TWB_SHIFT		24
#define SMC_TIMINGS4_TWB_MASK		0x0f
/** @defgroup smc_timings4_twb TWB WEN High to REN to Busy
@{*/
/**@}*/


#define SMC_TIMINGS4_TRR_SHIFT		16
#define SMC_TIMINGS4_TRR_MASK		0x0f
/** @defgroup smc_timings4_trr TRR Ready to REN Low Delay
@{*/
/**@}*/

/** SMC_TIMINGS4_OCMS Off Chip Memory Scrambling Enable **/
#define SMC_TIMINGS4_OCMS		(1 << 12)

#define SMC_TIMINGS4_TAR_SHIFT		8
#define SMC_TIMINGS4_TAR_MASK		0x0f
/** @defgroup smc_timings4_tar TAR ALE to REN Low Delay
@{*/
/**@}*/


#define SMC_TIMINGS4_TADL_SHIFT		4
#define SMC_TIMINGS4_TADL_MASK		0x0f
/** @defgroup smc_timings4_tadl TADL ALE to Data Start
@{*/
/**@}*/


#define SMC_TIMINGS4_TCLR_SHIFT		0
#define SMC_TIMINGS4_TCLR_MASK		0x0f
/** @defgroup smc_timings4_tclr TCLR CLE to REN Low Delay
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_mode4 MODE4 SMC Mode Register (CS_number = 4)
@{*/

/** SMC_MODE4_TDF_MODE TDF Optimization **/
#define SMC_MODE4_TDF_MODE		(1 << 20)

#define SMC_MODE4_TDF_CYCLES_SHIFT		16
#define SMC_MODE4_TDF_CYCLES_MASK		0x0f
/** @defgroup smc_mode4_tdf_cycles TDFCYCLES Data Float Time
@{*/
/**@}*/

/** SMC_MODE4_DBW Data Bus Width **/
#define SMC_MODE4_DBW		(1 << 12)
/** SMC_MODE4_BAT Byte Access Type **/
#define SMC_MODE4_BAT		(1 << 8)

#define SMC_MODE4_EXNW_MODE_SHIFT		4
#define SMC_MODE4_EXNW_MODE_MASK		0x03
/** @defgroup smc_mode4_exnw_mode EXNWMODE NWAIT Mode
@{*/
/**@}*/

