grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
/** SMC_MODE4_WRITE_MODE Selection of the Control Signal for Write Operation **/
#define SMC_MODE4_WRITE_MODE		(1 << 1)
/** SMC_MODE4_READ_MODE Selection of the Control Signal for Read Operation **/
#define SMC_MODE4_READ_MODE		(1 << 0)

/**@}*/

/** @defgroup smc_setup5 SETUP5 SMC Setup Register (CS_number = 5)
@{*/


#define SMC_SETUP5_NCS_RD_SETUP_SHIFT		24
#define SMC_SETUP5_NCS_RD_SETUP_MASK		0x3f
/** @defgroup smc_setup5_ncs_rd_setup NCSRDSETUP NCS Setup Length in Read Access
@{*/
/**@}*/


#define SMC_SETUP5_NRD_SETUP_SHIFT		16
#define SMC_SETUP5_NRD_SETUP_MASK		0x3f
/** @defgroup smc_setup5_nrd_setup NRDSETUP NRD Setup Length
@{*/
/**@}*/


#define SMC_SETUP5_NCS_WR_SETUP_SHIFT		8
#define SMC_SETUP5_NCS_WR_SETUP_MASK		0x3f
/** @defgroup smc_setup5_ncs_wr_setup NCSWRSETUP NCS Setup Length in Write Access
@{*/
/**@}*/


#define SMC_SETUP5_NWE_SETUP_SHIFT		0
#define SMC_SETUP5_NWE_SETUP_MASK		0x3f
/** @defgroup smc_setup5_nwe_setup NWESETUP NWE Setup Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_pulse5 PULSE5 SMC Pulse Register (CS_number = 5)
@{*/


#define SMC_PULSE5_NCS_RD_PULSE_SHIFT		24
#define SMC_PULSE5_NCS_RD_PULSE_MASK		0x7f
/** @defgroup smc_pulse5_ncs_rd_pulse NCSRDPULSE NCS Pulse Length in READ Access
@{*/
/**@}*/


#define SMC_PULSE5_NRD_PULSE_SHIFT		16
#define SMC_PULSE5_NRD_PULSE_MASK		0x7f
/** @defgroup smc_pulse5_nrd_pulse NRDPULSE NRD Pulse Length
@{*/
/**@}*/


#define SMC_PULSE5_NCS_WR_PULSE_SHIFT		8
#define SMC_PULSE5_NCS_WR_PULSE_MASK		0x7f
/** @defgroup smc_pulse5_ncs_wr_pulse NCSWRPULSE NCS Pulse Length in WRITE Access
@{*/
/**@}*/


#define SMC_PULSE5_NWE_PULSE_SHIFT		0
#define SMC_PULSE5_NWE_PULSE_MASK		0x7f
/** @defgroup smc_pulse5_nwe_pulse NWEPULSE NWE Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_cycle5 CYCLE5 SMC Cycle Register (CS_number = 5)
@{*/


#define SMC_CYCLE5_NRD_CYCLE_SHIFT		16
#define SMC_CYCLE5_NRD_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle5_nrd_cycle NRDCYCLE Total Read Cycle Length
@{*/
/**@}*/


#define SMC_CYCLE5_NWE_CYCLE_SHIFT		0
#define SMC_CYCLE5_NWE_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle5_nwe_cycle NWECYCLE Total Write Cycle Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_timings5 TIMINGS5 SMC Timings Register (CS_number = 5)
@{*/

/** SMC_TIMINGS5_NFSEL NAND Flash Selection **/
#define SMC_TIMINGS5_NFSEL		(1 << 31)

#define SMC_TIMINGS5_RBNSEL_SHIFT		28
#define SMC_TIMINGS5_RBNSEL_MASK		0x07
/** @defgroup smc_timings5_rbnsel RBNSEL Ready/Busy Line Selection
@{*/
/**@}*/


#define SMC_TIMINGS5_TWB_SHIFT		24
#define SMC_TIMINGS5_TWB_MASK		0x0f
/** @defgroup smc_timings5_twb TWB WEN High to REN to Busy
@{*/
/**@}*/


#define SMC_TIMINGS5_TRR_SHIFT		16
#define SMC_TIMINGS5_TRR_MASK		0x0f
/** @defgroup smc_timings5_trr TRR Ready to REN Low Delay
@{*/
/**@}*/

/** SMC_TIMINGS5_OCMS Off Chip Memory Scrambling Enable **/
#define SMC_TIMINGS5_OCMS		(1 << 12)

#define SMC_TIMINGS5_TAR_SHIFT		8
#define SMC_TIMINGS5_TAR_MASK		0x0f
/** @defgroup smc_timings5_tar TAR ALE to REN Low Delay
@{*/
/**@}*/


#define SMC_TIMINGS5_TADL_SHIFT		4
#define SMC_TIMINGS5_TADL_MASK		0x0f
/** @defgroup smc_timings5_tadl TADL ALE to Data Start
@{*/
/**@}*/


#define SMC_TIMINGS5_TCLR_SHIFT		0
#define SMC_TIMINGS5_TCLR_MASK		0x0f
/** @defgroup smc_timings5_tclr TCLR CLE to REN Low Delay
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_mode5 MODE5 SMC Mode Register (CS_number = 5)
@{*/

/** SMC_MODE5_TDF_MODE TDF Optimization **/
#define SMC_MODE5_TDF_MODE		(1 << 20)

#define SMC_MODE5_TDF_CYCLES_SHIFT		16
#define SMC_MODE5_TDF_CYCLES_MASK		0x0f
/** @defgroup smc_mode5_tdf_cycles TDFCYCLES Data Float Time
@{*/
/**@}*/

/** SMC_MODE5_DBW Data Bus Width **/
#define SMC_MODE5_DBW		(1 << 12)
/** SMC_MODE5_BAT Byte Access Type **/
#define SMC_MODE5_BAT		(1 << 8)

#define SMC_MODE5_EXNW_MODE_SHIFT		4
#define SMC_MODE5_EXNW_MODE_MASK		0x03
/** @defgroup smc_mode5_exnw_mode EXNWMODE NWAIT Mode
@{*/
/**@}*/

/** SMC_MODE5_WRITE_MODE Selection of the Control Signal for Write Operation **/
#define SMC_MODE5_WRITE_MODE		(1 << 1)
/** SMC_MODE5_READ_MODE Selection of the Control Signal for Read Operation **/
#define SMC_MODE5_READ_MODE		(1 << 0)

/**@}*/

/** @defgroup smc_setup6 SETUP6 SMC Setup Register (CS_number = 6)
@{*/


#define SMC_SETUP6_NCS_RD_SETUP_SHIFT		24
#define SMC_SETUP6_NCS_RD_SETUP_MASK		0x3f
/** @defgroup smc_setup6_ncs_rd_setup NCSRDSETUP NCS Setup Length in Read Access
@{*/
/**@}*/


#define SMC_SETUP6_NRD_SETUP_SHIFT		16
#define SMC_SETUP6_NRD_SETUP_MASK		0x3f
/** @defgroup smc_setup6_nrd_setup NRDSETUP NRD Setup Length
@{*/
/**@}*/


#define SMC_SETUP6_NCS_WR_SETUP_SHIFT		8
#define SMC_SETUP6_NCS_WR_SETUP_MASK		0x3f
/** @defgroup smc_setup6_ncs_wr_setup NCSWRSETUP NCS Setup Length in Write Access
@{*/
/**@}*/


#define SMC_SETUP6_NWE_SETUP_SHIFT		0
#define SMC_SETUP6_NWE_SETUP_MASK		0x3f
/** @defgroup smc_setup6_nwe_setup NWESETUP NWE Setup Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_pulse6 PULSE6 SMC Pulse Register (CS_number = 6)
@{*/


#define SMC_PULSE6_NCS_RD_PULSE_SHIFT		24
#define SMC_PULSE6_NCS_RD_PULSE_MASK		0x7f
/** @defgroup smc_pulse6_ncs_rd_pulse NCSRDPULSE NCS Pulse Length in READ Access
@{*/
/**@}*/


#define SMC_PULSE6_NRD_PULSE_SHIFT		16
#define SMC_PULSE6_NRD_PULSE_MASK		0x7f
/** @defgroup smc_pulse6_nrd_pulse NRDPULSE NRD Pulse Length
@{*/
/**@}*/


#define SMC_PULSE6_NCS_WR_PULSE_SHIFT		8
#define SMC_PULSE6_NCS_WR_PULSE_MASK		0x7f
/** @defgroup smc_pulse6_ncs_wr_pulse NCSWRPULSE NCS Pulse Length in WRITE Access
@{*/
/**@}*/


#define SMC_PULSE6_NWE_PULSE_SHIFT		0
#define SMC_PULSE6_NWE_PULSE_MASK		0x7f
/** @defgroup smc_pulse6_nwe_pulse NWEPULSE NWE Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_cycle6 CYCLE6 SMC Cycle Register (CS_number = 6)
@{*/


#define SMC_CYCLE6_NRD_CYCLE_SHIFT		16
#define SMC_CYCLE6_NRD_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle6_nrd_cycle NRDCYCLE Total Read Cycle Length
@{*/
/**@}*/


#define SMC_CYCLE6_NWE_CYCLE_SHIFT		0
#define SMC_CYCLE6_NWE_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle6_nwe_cycle NWECYCLE Total Write Cycle Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_timings6 TIMINGS6 SMC Timings Register (CS_number = 6)
@{*/

/** SMC_TIMINGS6_NFSEL NAND Flash Selection **/
#define SMC_TIMINGS6_NFSEL		(1 << 31)

#define SMC_TIMINGS6_RBNSEL_SHIFT		28
#define SMC_TIMINGS6_RBNSEL_MASK		0x07
/** @defgroup smc_timings6_rbnsel RBNSEL Ready/Busy Line Selection
@{*/
/**@}*/


#define SMC_TIMINGS6_TWB_SHIFT		24
#define SMC_TIMINGS6_TWB_MASK		0x0f
/** @defgroup smc_timings6_twb TWB WEN High to REN to Busy
@{*/
/**@}*/


#define SMC_TIMINGS6_TRR_SHIFT		16
#define SMC_TIMINGS6_TRR_MASK		0x0f
/** @defgroup smc_timings6_trr TRR Ready to REN Low Delay
@{*/
/**@}*/

/** SMC_TIMINGS6_OCMS Off Chip Memory Scrambling Enable **/
#define SMC_TIMINGS6_OCMS		(1 << 12)

#define SMC_TIMINGS6_TAR_SHIFT		8
#define SMC_TIMINGS6_TAR_MASK		0x0f
/** @defgroup smc_timings6_tar TAR ALE to REN Low Delay
@{*/
/**@}*/


#define SMC_TIMINGS6_TADL_SHIFT		4
#define SMC_TIMINGS6_TADL_MASK		0x0f
/** @defgroup smc_timings6_tadl TADL ALE to Data Start
@{*/
/**@}*/


#define SMC_TIMINGS6_TCLR_SHIFT		0
#define SMC_TIMINGS6_TCLR_MASK		0x0f
/** @defgroup smc_timings6_tclr TCLR CLE to REN Low Delay
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_mode6 MODE6 SMC Mode Register (CS_number = 6)
@{*/

/** SMC_MODE6_TDF_MODE TDF Optimization **/
#define SMC_MODE6_TDF_MODE		(1 << 20)

#define SMC_MODE6_TDF_CYCLES_SHIFT		16
#define SMC_MODE6_TDF_CYCLES_MASK		0x0f
/** @defgroup smc_mode6_tdf_cycles TDFCYCLES Data Float Time
@{*/
/**@}*/

