grevaillot/svd_tools/headers/ATSAM3X8H/smc.h
/** SMC_MODE6_DBW Data Bus Width **/
#define SMC_MODE6_DBW		(1 << 12)
/** SMC_MODE6_BAT Byte Access Type **/
#define SMC_MODE6_BAT		(1 << 8)

#define SMC_MODE6_EXNW_MODE_SHIFT		4
#define SMC_MODE6_EXNW_MODE_MASK		0x03
/** @defgroup smc_mode6_exnw_mode EXNWMODE NWAIT Mode
@{*/
/**@}*/

/** SMC_MODE6_WRITE_MODE Selection of the Control Signal for Write Operation **/
#define SMC_MODE6_WRITE_MODE		(1 << 1)
/** SMC_MODE6_READ_MODE Selection of the Control Signal for Read Operation **/
#define SMC_MODE6_READ_MODE		(1 << 0)

/**@}*/

/** @defgroup smc_setup7 SETUP7 SMC Setup Register (CS_number = 7)
@{*/


#define SMC_SETUP7_NCS_RD_SETUP_SHIFT		24
#define SMC_SETUP7_NCS_RD_SETUP_MASK		0x3f
/** @defgroup smc_setup7_ncs_rd_setup NCSRDSETUP NCS Setup Length in Read Access
@{*/
/**@}*/


#define SMC_SETUP7_NRD_SETUP_SHIFT		16
#define SMC_SETUP7_NRD_SETUP_MASK		0x3f
/** @defgroup smc_setup7_nrd_setup NRDSETUP NRD Setup Length
@{*/
/**@}*/


#define SMC_SETUP7_NCS_WR_SETUP_SHIFT		8
#define SMC_SETUP7_NCS_WR_SETUP_MASK		0x3f
/** @defgroup smc_setup7_ncs_wr_setup NCSWRSETUP NCS Setup Length in Write Access
@{*/
/**@}*/


#define SMC_SETUP7_NWE_SETUP_SHIFT		0
#define SMC_SETUP7_NWE_SETUP_MASK		0x3f
/** @defgroup smc_setup7_nwe_setup NWESETUP NWE Setup Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_pulse7 PULSE7 SMC Pulse Register (CS_number = 7)
@{*/


#define SMC_PULSE7_NCS_RD_PULSE_SHIFT		24
#define SMC_PULSE7_NCS_RD_PULSE_MASK		0x7f
/** @defgroup smc_pulse7_ncs_rd_pulse NCSRDPULSE NCS Pulse Length in READ Access
@{*/
/**@}*/


#define SMC_PULSE7_NRD_PULSE_SHIFT		16
#define SMC_PULSE7_NRD_PULSE_MASK		0x7f
/** @defgroup smc_pulse7_nrd_pulse NRDPULSE NRD Pulse Length
@{*/
/**@}*/


#define SMC_PULSE7_NCS_WR_PULSE_SHIFT		8
#define SMC_PULSE7_NCS_WR_PULSE_MASK		0x7f
/** @defgroup smc_pulse7_ncs_wr_pulse NCSWRPULSE NCS Pulse Length in WRITE Access
@{*/
/**@}*/


#define SMC_PULSE7_NWE_PULSE_SHIFT		0
#define SMC_PULSE7_NWE_PULSE_MASK		0x7f
/** @defgroup smc_pulse7_nwe_pulse NWEPULSE NWE Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_cycle7 CYCLE7 SMC Cycle Register (CS_number = 7)
@{*/


#define SMC_CYCLE7_NRD_CYCLE_SHIFT		16
#define SMC_CYCLE7_NRD_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle7_nrd_cycle NRDCYCLE Total Read Cycle Length
@{*/
/**@}*/


#define SMC_CYCLE7_NWE_CYCLE_SHIFT		0
#define SMC_CYCLE7_NWE_CYCLE_MASK		0x1ff
/** @defgroup smc_cycle7_nwe_cycle NWECYCLE Total Write Cycle Length
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_timings7 TIMINGS7 SMC Timings Register (CS_number = 7)
@{*/

/** SMC_TIMINGS7_NFSEL NAND Flash Selection **/
#define SMC_TIMINGS7_NFSEL		(1 << 31)

#define SMC_TIMINGS7_RBNSEL_SHIFT		28
#define SMC_TIMINGS7_RBNSEL_MASK		0x07
/** @defgroup smc_timings7_rbnsel RBNSEL Ready/Busy Line Selection
@{*/
/**@}*/


#define SMC_TIMINGS7_TWB_SHIFT		24
#define SMC_TIMINGS7_TWB_MASK		0x0f
/** @defgroup smc_timings7_twb TWB WEN High to REN to Busy
@{*/
/**@}*/


#define SMC_TIMINGS7_TRR_SHIFT		16
#define SMC_TIMINGS7_TRR_MASK		0x0f
/** @defgroup smc_timings7_trr TRR Ready to REN Low Delay
@{*/
/**@}*/

/** SMC_TIMINGS7_OCMS Off Chip Memory Scrambling Enable **/
#define SMC_TIMINGS7_OCMS		(1 << 12)

#define SMC_TIMINGS7_TAR_SHIFT		8
#define SMC_TIMINGS7_TAR_MASK		0x0f
/** @defgroup smc_timings7_tar TAR ALE to REN Low Delay
@{*/
/**@}*/


#define SMC_TIMINGS7_TADL_SHIFT		4
#define SMC_TIMINGS7_TADL_MASK		0x0f
/** @defgroup smc_timings7_tadl TADL ALE to Data Start
@{*/
/**@}*/


#define SMC_TIMINGS7_TCLR_SHIFT		0
#define SMC_TIMINGS7_TCLR_MASK		0x0f
/** @defgroup smc_timings7_tclr TCLR CLE to REN Low Delay
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_mode7 MODE7 SMC Mode Register (CS_number = 7)
@{*/

/** SMC_MODE7_TDF_MODE TDF Optimization **/
#define SMC_MODE7_TDF_MODE		(1 << 20)

#define SMC_MODE7_TDF_CYCLES_SHIFT		16
#define SMC_MODE7_TDF_CYCLES_MASK		0x0f
/** @defgroup smc_mode7_tdf_cycles TDFCYCLES Data Float Time
@{*/
/**@}*/

/** SMC_MODE7_DBW Data Bus Width **/
#define SMC_MODE7_DBW		(1 << 12)
/** SMC_MODE7_BAT Byte Access Type **/
#define SMC_MODE7_BAT		(1 << 8)

#define SMC_MODE7_EXNW_MODE_SHIFT		4
#define SMC_MODE7_EXNW_MODE_MASK		0x03
/** @defgroup smc_mode7_exnw_mode EXNWMODE NWAIT Mode
@{*/
/**@}*/

/** SMC_MODE7_WRITE_MODE Selection of the Control Signal for Write Operation **/
#define SMC_MODE7_WRITE_MODE		(1 << 1)
/** SMC_MODE7_READ_MODE Selection of the Control Signal for Read Operation **/
#define SMC_MODE7_READ_MODE		(1 << 0)

/**@}*/

/** @defgroup smc_ocms OCMS SMC OCMS Register
@{*/

/** SMC_OCMS_SRSE SRAM Scrambling Enable **/
#define SMC_OCMS_SRSE		(1 << 1)
/** SMC_OCMS_SMSE Static Memory Controller Scrambling Enable **/
#define SMC_OCMS_SMSE		(1 << 0)

/**@}*/

/** @defgroup smc_key1 KEY1 SMC OCMS KEY1 Register
@{*/


#define SMC_KEY1_KEY1_SHIFT		0
#define SMC_KEY1_KEY1_MASK		0xffffffff
/** @defgroup smc_key1_key1 KEY1 Off Chip Memory Scrambling (OCMS) Key Part 1
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_key2 KEY2 SMC OCMS KEY2 Register
@{*/


#define SMC_KEY2_KEY2_SHIFT		0
#define SMC_KEY2_KEY2_MASK		0xffffffff
/** @defgroup smc_key2_key2 KEY2 Off Chip Memory Scrambling (OCMS) Key Part 2
@{*/
/**@}*/


/**@}*/

/** @defgroup smc_wpcr WPCR Write Protection Control Register
@{*/


#define SMC_WPCR_WP_KEY_SHIFT		8
#define SMC_WPCR_WP_KEY_MASK		0xffffff
/** @defgroup smc_wpcr_wp_key WPKEY Write Protection KEY Password
@{*/
/**@}*/

/** SMC_WPCR_WP_EN Write Protection Enable **/
#define SMC_WPCR_WP_EN		(1 << 0)

/**@}*/

/** @defgroup smc_wpsr WPSR Write Protection Status Register
@{*/


#define SMC_WPSR_WP_VSRC_SHIFT		8
#define SMC_WPSR_WP_VSRC_MASK		0xffff
/** @defgroup smc_wpsr_wp_vsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/


#define SMC_WPSR_WP_VS_SHIFT		0
#define SMC_WPSR_WP_VS_MASK		0x0f
/** @defgroup smc_wpsr_wp_vs WPVS Write Protection Violation Status
@{*/
/**@}*/


/**@}*/
